Revit 2027 API
ParameterTypeId.PointElementMeasurementType Property
 "Measurement Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PointElementMeasurementType { get; }
Public Shared ReadOnly Property PointElementMeasurementType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PointElementMeasurementType {
	ForgeTypeId^ get ();
}
static member PointElementMeasurementType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace